"""
通达信专业财务文件映射表

出处：通达信软件自带的专业财务函数的说明
说明:
1.所有指标没有标注单位的都是个位,如资金项单位都是元,股本单位都是股。
2.所有的空值数据显示为0,以方便客户加减运算,非金融类指标在指标名称后有标注。
"""

finance_mapping = {
    0: "code",
    # ---------------------每股指标
    1: "基本每股收益",
    4: "每股净资产",
    7: "每股经营现金流量",
    # ---------------------资产负债表 资产
    8: "货币资金",
    10: "应收票据",
    11: "应收账款",
    17: "存货",
    24: "长期应收款",
    35: "商誉",
    40: "资产总计",
    # ---------------------资产负债表 负债
    41: "短期借款",
    42: "交易性金融负债",
    43: "应付票据",
    44: "应付账款",
    45: "预收款项",
    46: "应付职工薪酬",
    47: "应交税费",
    52: "一年内到期的非流动负债",
    55: "长期借款",
    56: "应付债券",
    57: "长期应付款",
    63: "负债合计",
    # ---------------------资产负债表 所有者权益
    64: "股本",
    65: "资本公积",
    66: "盈余公积",
    68: "未分配利润",
    # ---------------------利润表
    74: "营业收入",
    75: "营业成本",
    77: "销售费用",
    78: "管理费",
    80: "财务费",
    88: "营业外收入",
    95: "净利润",
    107: "经营活动产生的现金流量净额",
    172: "应收帐款周转率",
    173: "存货周转率",
    175: "总资产周转率",
    176: "固定资产周转率",
    177: "应收帐款周转天数",
    178: "存货周转天数",
    183: "营业收入增长率",
    184: "净利润增长率",
    197: "净资产收益率",
    199: "销售净利率",
    202: "销售毛利率",
    205: "财务费用率",
    238: "总股本",
    239: "流通股",
    412: "向中央银行借款",  # 万元
    414: "拆入资金",  # 万元
    415: "衍生金融负债",  # 万元
    434: "合同负债",  # 万元
    437: "应收款项融资",  # 万元
    517: "信用减值损失2018",  # 万元 2018年及前
    520: "信用减值损失2019",  # 万元 2019年开始
    580: "信用减值损失",  # 万元
}
